# Groupby

In [4]:
# for arranging random data in a sequences data we use groupby fxn

import pandas as pd

var = pd.DataFrame({"name":["sara","dara","ayush","dave","dara","ayush","ayush","sara","ayush","sara","dave"],"S_1":[12,13,14,15,16,17,18,19,19,15,16],"S_2":[2,1,1.4,1.5,16,11,25,19,1.9,1.5,16]})

var

     name  S_1   S_2
0    sara   12   2.0
1    dara   13   1.0
2   ayush   14   1.4
3    dave   15   1.5
4    dara   16  16.0
5   ayush   17  11.0
6   ayush   18  25.0
7    sara   19  19.0
8   ayush   19   1.9
9    sara   15   1.5
10   dave   16  16.0

In [ ]:
# creating or making random data sequential by groupby method

var_new = var.groupby("name")
var_new

In [8]:
# showing the data

for x,y in var_new:
    print(x)
    print(y)
    print()

ayush
    name  S_1   S_2
2  ayush   14   1.4
5  ayush   17  11.0
6  ayush   18  25.0
8  ayush   19   1.9

dara
   name  S_1   S_2
1  dara   13   1.0
4  dara   16  16.0

dave
    name  S_1   S_2
3   dave   15   1.5
10  dave   16  16.0

sara
   name  S_1   S_2
0  sara   12   2.0
7  sara   19  19.0
9  sara   15   1.5

In [ ]:
# when we need data of one group : we will use get_group() function

var_new.get_group("sara")
var_new.get_group("ayush")

    name  S_1   S_2
2  ayush   14   1.4
5  ayush   17  11.0
6  ayush   18  25.0
8  ayush   19   1.9

In [16]:
# if we want to get min,max, mean , meadian , mod from group : use 

var_new.min()
var_new.max()
var_new.mean()
var_new.median()

# we can convert into the list of this data : 

li = list(var_new)
li

[('ayush',
      name  S_1   S_2
  2  ayush   14   1.4
  5  ayush   17  11.0
  6  ayush   18  25.0
  8  ayush   19   1.9),
 ('dara',
     name  S_1   S_2
  1  dara   13   1.0
  4  dara   16  16.0),
 ('dave',
      name  S_1   S_2
  3   dave   15   1.5
  10  dave   16  16.0),
 ('sara',
     name  S_1   S_2
  0  sara   12   2.0
  7  sara   19  19.0
  9  sara   15   1.5)]